
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/13205145054)


<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_vpc_endpoint.interface[&#34;ecr_api&#34;]
  * aws_vpc_endpoint.interface[&#34;ecr_dkr&#34;]
  * aws_vpc_endpoint.interface_logs
  * aws_vpc_endpoint.s3_gateway
* Update
  * aws_ecs_service.backend


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.backend will be updated in-place
  ~ resource "aws_ecs_service" "backend" {
      ~ desired_count                      = 0 -> 1
        id                                 = "arn:aws:ecs:ap-northeast-1:992382441056:service/backend/backend"
        name                               = "backend"
        tags                               = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.interface["ecr_api"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "ecr_api"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_api"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.interface["ecr_dkr"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "ecr_dkr"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_dkr"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.interface_logs will be created
  + resource "aws_vpc_endpoint" "interface_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "cw-logs"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "cw-logs"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3_gateway will be created
  + resource "aws_vpc_endpoint" "s3_gateway" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-00bfb2a9a2de18751",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3_gateway"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "s3_gateway"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"87e04e914864717f3d79d2e50feb70fcf1150602","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->